In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69],
                   'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                   'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                   'height':[165, 70, 120, 80, 180, 172, 150],
                   'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2],
                   'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']
                   },
                  index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])
df

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

# [],.,loc,iloc辨析

## 点选和切片索引

选一列：df.food和df['food']效果一样，输出结果数据类型都是Series

选一列：df[['food']]输出结果是DataFrame数据结构

选多列：df[['food','score']]，数据结构是DataFrame

选一行：假设现在要选第一行，df[:1]是对的，但是df[0]会报错

选多行：df[2:6:2]

注意：[]索引不可以同时选择行和列

In [ ]:
#输出结果数据类型都是Series
df.food
df['food']

In [9]:
df[:1]

      age color   food  height  score state
Jane   30  blue  Steak     165    4.6    NY

In [10]:
df[['food']]

             food
Jane        Steak
Nick         Lamb
Aaron       Mango
Penelope    Apple
Dean       Cheese
Christina   Melon
Cornelia    Beans

In [13]:
print(type(df[['food','score']]))
df[['food','score']]#df['food','score']报错

<class 'pandas.core.frame.DataFrame'>

             food  score
Jane        Steak    4.6
Nick         Lamb    8.3
Aaron       Mango    9.0
Penelope    Apple    3.3
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

.loc selects data only by labels  
.iloc selects data only by integer location

## Selecting a single row with .loc with a string
## Selecting multiple rows with .loc with a list of strings
## Selecting a single row with .iloc with an integer

In [15]:
df.loc['Penelope']

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [17]:
df.loc[['Cornelia', 'Jane', 'Dean']]

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [19]:
df.loc['Aaron':'Dean']

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

## Selecting a single row with .iloc with an integer
## Selecting multiple rows with .iloc with a list of integers
## Selecting multiple rows with .iloc with slice notation

In [20]:
df.iloc[4]

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [21]:
df.iloc[[2, -2]]

           age  color   food  height  score state
Aaron       12    red  Mango     120    9.0    FL
Christina   33  black  Melon     172    9.5    TX

In [22]:
df.iloc[:5:3]

          age  color   food  height  score state
Jane       30   blue  Steak     165    4.6    NY
Penelope    4  white  Apple      80    3.3    AL

## Simultaneous selection of rows and columns with .loc and .iloc

In [24]:
df.loc[['Jane', 'Dean'], 'height':]

      height  score state
Jane     165    4.6    NY
Dean     180    1.8    AK

In [25]:
df.iloc[[1,4], 2]

Nick      Lamb
Dean    Cheese
Name: food, dtype: object

## 条件索引：Boolean Selection

In [26]:
df.loc[df['age'] > 30, ['food', 'score']]

             food  score
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

In [28]:
df.iloc[(df['age'] > 30).values, [2, 4]]

             food  score
Dean       Cheese    1.8
Christina   Melon    9.5
Cornelia    Beans    2.2

## Selecting all rows

In [29]:
df.loc[:, 'color':'score':2]

           color  height
Jane        blue     165
Nick       green      70
Aaron        red     120
Penelope   white      80
Dean        gray     180
Christina  black     172
Cornelia     red     150

In [31]:
import numpy as np

In [32]:
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
    'key2':['one', 'two', 'one', 'two', 'one'],
    'data1':np.random.randn(5),
    'data2':np.random.randn(5)})

In [33]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.894959 -0.014608    a  one
1  1.145288  0.877170    a  two
4 -0.449471  1.301591    a  one
b
      data1     data2 key1 key2
2 -0.483540 -0.515213    b  one
3 -0.221953 -0.791975    b  two

In [35]:
for name, group in df.groupby('key1'):
    print(group)

      data1     data2 key1 key2
0 -0.894959 -0.014608    a  one
1  1.145288  0.877170    a  two
4 -0.449471  1.301591    a  one
      data1     data2 key1 key2
2 -0.483540 -0.515213    b  one
3 -0.221953 -0.791975    b  two